app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]
---
	def create
	  @post = Post.new
	  @post.title = params[:post][:title]
	  @post.description = params[:post][:description]
	  @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2015-12-31 21:17:16.238910"], ["id", 3]]
---
	def update
	  @post = Post.find(params[:id])
	  # The method below will return an error as 'unpermitted' even though it's what we normally use:
	  # @post.update(title: params[:title], description: params[:description])

	  # Instead we need to use the strong params require within the update method such as below:
	  @post.update(params.require(:post).permit(:title, :description))